art_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index
        #render plain: "I'm in the index action!"
        @artworks = Artwork.all