art_api/app/controllers/artworks_controller.rb

    def index
        #user_art = Artwork.find_by(artist_id: params[:user_id])
        param_id = params[:user_id]
        artwork_by = Artwork.select('*')
                      .where(artist_id: params[:user_id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", "1"]]

    def create
        artwork = Artwork.new(artwork_params)
        # replace the `Artwork_attributes_here` with the actual attribute keys
        if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "painting"], ["image_url", "google"], ["artist_id", "2"], ["created_at", "2021-11-11 21:20:54.699905"], ["updated_at", "2021-11-11 21:20:54.699905"]]

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "drawing"], ["updated_at", "2021-11-11 21:21:40.000404"], ["id", 4]]

    def destroy
        artwork = Artwork.find(params[:id])
        if artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]