art_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        #render plain: "I'm in the index action!"
        @users = User.all

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2021-11-11 20:35:34.287748"], ["updated_at", "2021-11-11 20:35:34.287748"], ["username", "Christian"]]
---
    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "George"], ["email", "george@gmail.com"], ["updated_at", "2021-11-11 15:47:50.811809"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        user = User.find(params[:id])
        if user.destroy